In [1]:
location_elevation=[['Battle Hill',220],['Marcus Garvey Park',103],['Bennett Park',265],\
                           ['Todt Hill',410],['Washington Square Park',27],['Chapel Farm',280],\
                           ['Bryant Park',58],['North Glen Oaks',258],['St Marys Park',47]]

In [4]:
location_elevation[0][1]

220

In [5]:
import pandas as pd

In [6]:
pd.DataFrame(location_elevation)

                        0    1
0             Battle Hill  220
1      Marcus Garvey Park  103
2            Bennett Park  265
3               Todt Hill  410
4  Washington Square Park   27
5             Chapel Farm  280
6             Bryant Park   58
7         North Glen Oaks  258
8           St Marys Park   47

In [7]:
customers = [
    { "first_name": "Tom", "last_name": "Bell", "revenue": 0 },
    { "first_name": "Maggie", "last_name": "Johnson", "revenue": 1032 },
    { "first_name": "John", "last_name": "Spectre", "revenue": 2543 },
    { "first_name": "Susy", "last_name": "Simmons", "revenue": 5322 }
]

In [8]:
customers

[{'first_name': 'Tom', 'last_name': 'Bell', 'revenue': 0},
 {'first_name': 'Maggie', 'last_name': 'Johnson', 'revenue': 1032},
 {'first_name': 'John', 'last_name': 'Spectre', 'revenue': 2543},
 {'first_name': 'Susy', 'last_name': 'Simmons', 'revenue': 5322}]

In [9]:
list(enumerate(customers))

[(0, {'first_name': 'Tom', 'last_name': 'Bell', 'revenue': 0}),
 (1, {'first_name': 'Maggie', 'last_name': 'Johnson', 'revenue': 1032}),
 (2, {'first_name': 'John', 'last_name': 'Spectre', 'revenue': 2543}),
 (3, {'first_name': 'Susy', 'last_name': 'Simmons', 'revenue': 5322})]

In [10]:
customers[2]

{'first_name': 'John', 'last_name': 'Spectre', 'revenue': 2543}

In [11]:
customers[2]['first_name']

'John'

In [13]:
customer_df = pd.DataFrame(customers)
customer_df

  first_name last_name  revenue
0        Tom      Bell        0
1     Maggie   Johnson     1032
2       John   Spectre     2543
3       Susy   Simmons     5322

In [16]:
customer_df[["revenue"]]

   revenue
0        0
1     1032
2     2543
3     5322

In [17]:
customer_df.columns

Index(['first_name', 'last_name', 'revenue'], dtype='object')

In [18]:
customer_df.columns.str.replace("first_name","First_Name")

Index(['First_Name', 'last_name', 'revenue'], dtype='object')

In [20]:
customer_df[["first_name","last_name"]][0:2]

  first_name last_name
0        Tom      Bell
1     Maggie   Johnson

In [21]:
boro = ['Bronx', 'Manhattan', 'Brooklyn', 'Staten Island', 'Queens']
pop  = [1.39e6,1.59e6,2.47e6,0.44e6,2.23e6]
area = [42, 23, 71, 59, 109]
df_e=pd.DataFrame([boro,pop,area]).T
df_e.columns=["boro","pop","area"]
df_e

            boro        pop area
0          Bronx  1390000.0   42
1      Manhattan  1590000.0   23
2       Brooklyn  2470000.0   71
3  Staten Island   440000.0   59
4         Queens  2230000.0  109

In [24]:
df_e.set_index("boro",inplace= True)

In [25]:
df_e

                     pop area
boro
Bronx          1390000.0   42
Manhattan      1590000.0   23
Brooklyn       2470000.0   71
Staten Island   440000.0   59
Queens         2230000.0  109

In [26]:
df_e["dendity"]=df_e["pop"]/df_e["area"]
df_e

                     pop area       dendity
boro
Bronx          1390000.0   42  33095.238095
Manhattan      1590000.0   23  69130.434783
Brooklyn       2470000.0   71  34788.732394
Staten Island   440000.0   59   7457.627119
Queens         2230000.0  109  20458.715596

In [27]:
df_e.columns = ["population", "area in square miles", "density"]

In [28]:
df_e.loc["Bronx"]

population                 1390000.0
area in square miles              42
density                 33095.238095
Name: Bronx, dtype: object

In [29]:
df_e.loc[["Bronx","Manhattan"]]

          population area in square miles       density
boro
Bronx      1390000.0                   42  33095.238095
Manhattan  1590000.0                   23  69130.434783

In [31]:
df_e.loc[df_e["density"]>33000]

          population area in square miles       density
boro
Bronx      1390000.0                   42  33095.238095
Manhattan  1590000.0                   23  69130.434783
Brooklyn   2470000.0                   71  34788.732394

In [35]:
present_value = 1000
interest_rate = .1
compounding_periods = 1
years = 3

def calculate_future_value(present_value,interest_rate,compounding_periods,years):
    future_value = present_value * ((1+(interest_rate/compounding_periods))**(compounding_periods * years))
    return future_value

In [38]:
calculate_future_value_1 = calculate_future_value(present_value,interest_rate,compounding_periods, years)

In [37]:
calculate_future_value(10,.1,1,3)

13.310000000000004

In [45]:
print(f"future value of ${present_value} at an interest rate of {interest_rate}%, \
compunded {compounding_periods} over the {years} years is ${round(calculate_future_value_1,4)}")

future value of $1000 at an interest rate of 0.1%, compunded 1 over the 3 years is $1331.0

In [46]:
calculate_future_value(1200,3,365,5)

3689543984.878045

In [67]:
### price of bond = Face Value(present_value) / (1+r)**n
price = 700
future_value = 1000
discount_rate = .1
compounding_periods = 1
years = 5
def calculate_present_value(future_value,discount_rate,compounding_periods,years):
    present_value = future_value / (1+(discount_rate/compounding_periods))**(compounding_periods * years)
    return present_value

In [68]:
present_value = calculate_present_value(future_value,discount_rate,compounding_periods,years)
present_value

620.9213230591549

In [69]:
if present_value > price:
    print(f"purchase the bond")
elif bond_value < price:
    print(f"do not purchase the bond")
else:
    print(f"the bond is selling at its fair market value, you're neutral to the decision")

do not purchase the bond

In [70]:
calculate_present_value(13.31000000004,.1,1,3)

10.00000000003005

In [111]:
import pandas as pd

In [87]:
import functions as fc

In [85]:
fc.print_hello()

hello!

In [86]:
fc.print_goodbye()

goodbye!

In [82]:
pwd

'/Users/syedahasan/Desktop/fintech'

In [93]:
import numpy_financial as npf

In [ ]:
## conda install -c conda-forge numpy-financial
## pip install numpy-financial

In [94]:
cash_flows_conservative = [-1000, 400, 400, 400, 400]
cash_flows_neutral = [-1500, 600, 600, 600, 600]
cash_flows_aggressive = [-2250, 800, 800, 800, 800]

In [97]:
discount_rate = .1
npf.npv(discount_rate,cash_flows_conservative)

267.94617853971704

In [ ]:
read, write , append

In [99]:
from pathlib import Path

In [100]:
relatibe_filepath = Path("input.txt")
absolute_filepath = Path("/Users/syedahasan/Desktop/fintech/input.txt")

In [101]:
relatibe_filepath

PosixPath('input.txt')

In [102]:
absolute_filepath

PosixPath('/Users/syedahasan/Desktop/fintech/input.txt')

In [107]:
#read
with open(relatibe_filepath,"r") as file:
    print(file.read())

List of Best Actors:
Nicolas Cage
Betty White
Gary Busey

In [108]:
#append
with open(relatibe_filepath,"a") as file:
    file.write("\nthis is a new entry i make\n") # \n new line

In [110]:
#write
output_path = "/Users/syedahasan/Desktop/fintech/output.txt"
with open(output_path,"w") as file:
    file.write("this is output file")

In [113]:
actores_df = pd.read_csv("input.txt")

In [114]:
actores_df

         List of Best Actors:
0                Nicolas Cage
1                 Betty White
2                  Gary Busey
3  this is a new entry i make

In [115]:
actores_df.loc[0]

List of Best Actors:    Nicolas Cage
Name: 0, dtype: object

In [116]:
actores_df.columns

Index(['List of Best Actors:'], dtype='object')

In [117]:
actores_df.loc[0]

List of Best Actors:    Nicolas Cage
Name: 0, dtype: object

In [118]:
actores_df.to_csv("/Users/syedahasan/Desktop/fintech/actors.txt")